
## Plan Result (demo)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_private_endpoint.cvp_vnet_private_endpoint[0]
  * azurerm_private_endpoint.vh_vnet_private_endpoint[0]
* Update
  * module.storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_private_endpoint.cvp_vnet_private_endpoint[0] will be created
  + resource "azurerm_private_endpoint" "cvp_vnet_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "emhrsapidemo"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "cvp-recordings-sbox-rg"
      + subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/cvp-recordings-sbox-rg/providers/Microsoft.Network/virtualNetworks/cvp-recordings-sbox-vnet/subnets/wowza"
      + tags                     = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "demo"
          + "managedBy"           = "Evidence Management"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "emhrsapidemo"
          + private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-hrs-api-demo/providers/Microsoft.Storage/storageAccounts/emhrsapidemo"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # azurerm_private_endpoint.vh_vnet_private_endpoint[0] will be created
  + resource "azurerm_private_endpoint" "vh_vnet_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "emhrsapidemo"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "vh-infra-wowza-demo"
      + subnet_id                = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/vh-infra-wowza-demo/providers/Microsoft.Network/virtualNetworks/vh-infra-wowza-demo/subnets/wowza"
      + tags                     = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "demo"
          + "managedBy"           = "Evidence Management"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "emhrsapidemo"
          + private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-hrs-api-demo/providers/Microsoft.Storage/storageAccounts/emhrsapidemo"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-hrs-api-demo/providers/Microsoft.Storage/storageAccounts/emhrsapidemo"
        name                               = "emhrsapidemo"
      ~ public_network_access_enabled      = false -> true
        tags                               = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "demo"
            "managedBy"           = "Evidence Management"
        }
        # (95 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2420,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->